{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution\assignment.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jan 2022, 18:05:35

{com}. 
. 
. 
. /*
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. Author: Bin Cheng
{err}command {bf}Author{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. Terms of use data, code and log files:
{err}command {bf}Terms{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. 
. do not distribute and do not use the data for purposes outside this course
{err}{p 0 4 2}
file not.do
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. 
. */

. 
. 
. 
. 
. 
. use Data,clear
{err}{p 0 4 2}
file Data.dta
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. 
. 
. 
. xtset ID period
{res}{txt}{col 8}panel variable:  {res}ID (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}period, 1 to 2
{txt}{col 17}delta:  {res}1 unit

{com}. 
. 
. 
. *1)Some descriptives

. 
. 
. 
. sum male ability_math ability_language parentcollege if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1

{com}. 
. //ability by construction normalized 0-1 (in initial data), balanced in terms of gender, 30% has parent who went to college
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. sum school degree if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. //91% reaches final stage of high school, 78% finishes high school successfully
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. sum school distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. //58% goes to college, distance is 8.5km on average
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. sum school if period==2 & L.degree==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      4,012     .748006     .434212          0          1

{com}. 
. //74.8% of high school graduates go to college
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. corr male ability_math ability_language parentcollege if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e
{hline 13}{c +}{hline 36}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000


{com}. 
. //ability measures highly correlated, also a bit with parental education
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1, robust

{txt}Linear regression                               Number of obs     = {res}     5,158
                                                {txt}F(4, 5153)        =  {res}   117.35
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1192
                                                {txt}Root MSE          =    {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0076798{col 41}{space 1}   -9.13{col 50}{space 3}0.000{col 58}{space 4}-.0851803{col 71}{space 3}-.0550689
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0069619{col 41}{space 1}    6.91{col 50}{space 3}0.000{col 58}{space 4} .0344351{col 71}{space 3} .0617317
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0063957{col 41}{space 1}    8.63{col 50}{space 3}0.000{col 58}{space 4} .0426563{col 71}{space 3} .0677328
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0065249{col 41}{space 1}    4.48{col 50}{space 3}0.000{col 58}{space 4} .0164205{col 71}{space 3} .0420037
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0049775{col 41}{space 1}  186.50{col 50}{space 3}0.000{col 58}{space 4} .9185496{col 71}{space 3} .9380656
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. //males, low ability and parents who didn't go to college -> more likely to drop out from high school
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1, robust

{txt}Linear regression                               Number of obs     = {res}     4,669
                                                {txt}F(4, 4664)        =  {res}   195.63
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1827
                                                {txt}Root MSE          =    {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0093585{col 41}{space 1}   -5.41{col 50}{space 3}0.000{col 58}{space 4}-.0689757{col 71}{space 3}-.0322816
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0085467{col 41}{space 1}    9.15{col 50}{space 3}0.000{col 58}{space 4} .0614051{col 71}{space 3} .0949161
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0079701{col 41}{space 1}   11.38{col 50}{space 3}0.000{col 58}{space 4} .0750835{col 71}{space 3}  .106334
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2}  .008101{col 41}{space 1}    6.23{col 50}{space 3}0.000{col 58}{space 4} .0345923{col 71}{space 3} .0663558
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0069411{col 41}{space 1}  122.09{col 50}{space 3}0.000{col 58}{space 4} .8338219{col 71}{space 3} .8610377
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. //similar effects on failing in high school
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==2 & L.degree==1, robust

{txt}Linear regression                               Number of obs     = {res}     4,012
                                                {txt}F(4, 4007)        =  {res}   376.72
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2453
                                                {txt}Root MSE          =    {res}  .3774

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 18}{c |}{col 30}    Robust
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0977372{col 30}{space 2}  .012111{col 41}{space 1}   -8.07{col 50}{space 3}0.000{col 58}{space 4}-.1214815{col 71}{space 3}-.0739929
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1285362{col 30}{space 2} .0104109{col 41}{space 1}   12.35{col 50}{space 3}0.000{col 58}{space 4} .1081251{col 71}{space 3} .1489473
{txt}ability_language {c |}{col 18}{res}{space 2}  .127969{col 30}{space 2} .0096368{col 41}{space 1}   13.28{col 50}{space 3}0.000{col 58}{space 4} .1090755{col 71}{space 3} .1468625
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}  .110939{col 30}{space 2}  .011807{col 41}{space 1}    9.40{col 50}{space 3}0.000{col 58}{space 4} .0877906{col 71}{space 3} .1340873
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .6890157{col 30}{space 2} .0096633{col 41}{space 1}   71.30{col 50}{space 3}0.000{col 58}{space 4} .6700702{col 71}{space 3} .7079612
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. //similar effects but larger for college entry
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. *2) A static discrete choice model

. 
. 
. 
. *high school stage (period 1)

. 
. logit school male ability_math ability_language parentcollege if period==1 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.9491516{col 30}{space 2} .1106502{col 41}{space 1}   -8.58{col 50}{space 3}0.000{col 58}{space 4}-1.166022{col 71}{space 3}-.7322812
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .5250864{col 30}{space 2} .0807139{col 41}{space 1}    6.51{col 50}{space 3}0.000{col 58}{space 4} .3668901{col 71}{space 3} .6832828
{txt}ability_language {c |}{col 18}{res}{space 2} .7062783{col 30}{space 2} .0812405{col 41}{space 1}    8.69{col 50}{space 3}0.000{col 58}{space 4} .5470499{col 71}{space 3} .8655067
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9583825{col 30}{space 2} .1899294{col 41}{space 1}    5.05{col 50}{space 3}0.000{col 58}{space 4} .5861277{col 71}{space 3} 1.330637
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 3.096661{col 30}{space 2} .1038889{col 41}{space 1}   29.81{col 50}{space 3}0.000{col 58}{space 4} 2.893042{col 71}{space 3} 3.300279
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est store hs_static

. 
. predict hs_static_pr
{txt}(option {bf:pr} assumed; Pr(school))

{com}. 
. 
. 
. *state transition: degree

. 
. logit degree male ability_math ability_language parentcollege if period==1 & school==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.4807057{col 30}{space 2} .0971424{col 41}{space 1}   -4.95{col 50}{space 3}0.000{col 58}{space 4}-.6711013{col 71}{space 3}  -.29031
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .6448108{col 30}{space 2} .0749611{col 41}{space 1}    8.60{col 50}{space 3}0.000{col 58}{space 4} .4978896{col 71}{space 3} .7917319
{txt}ability_language {c |}{col 18}{res}{space 2} .8998475{col 30}{space 2} .0764428{col 41}{space 1}   11.77{col 50}{space 3}0.000{col 58}{space 4} .7500223{col 71}{space 3} 1.049673
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} 1.049599{col 30}{space 2} .1597167{col 41}{space 1}    6.57{col 50}{space 3}0.000{col 58}{space 4} .7365598{col 71}{space 3} 1.362638
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 2.217168{col 30}{space 2} .0812127{col 41}{space 1}   27.30{col 50}{space 3}0.000{col 58}{space 4} 2.057994{col 71}{space 3} 2.376341
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est store degree

. 
. predict degree_pr
{txt}(option {bf:pr} assumed; Pr(degree))

{com}. 
. 
. 
. *college stage (period 2)

. 
. logit school male ability_math ability_language parentcollege dist if period==2 & L.degree==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.6344893{col 30}{space 2} .0866098{col 41}{space 1}   -7.33{col 50}{space 3}0.000{col 58}{space 4}-.8042414{col 71}{space 3}-.4647373
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .7953581{col 30}{space 2}  .074274{col 41}{space 1}   10.71{col 50}{space 3}0.000{col 58}{space 4} .6497838{col 71}{space 3} .9409325
{txt}ability_language {c |}{col 18}{res}{space 2} .9388417{col 30}{space 2}  .075427{col 41}{space 1}   12.45{col 50}{space 3}0.000{col 58}{space 4} .7910074{col 71}{space 3} 1.086676
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9697686{col 30}{space 2} .1099471{col 41}{space 1}    8.82{col 50}{space 3}0.000{col 58}{space 4} .7542763{col 71}{space 3} 1.185261
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0107217{col 30}{space 2} .0083939{col 41}{space 1}   -1.28{col 50}{space 3}0.201{col 58}{space 4}-.0271734{col 71}{space 3} .0057301
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 1.125917{col 30}{space 2} .0955432{col 41}{space 1}   11.78{col 50}{space 3}0.000{col 58}{space 4} .9386556{col 71}{space 3} 1.313178
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est store college

. 
. predict college_pr
{txt}(option {bf:pr} assumed; Pr(school))

{com}. 
. 
. 
. *joint probability that specifies college enrollment number

. 
. gen college_pr_static_total=hs_static_pr*degree_pr*college_pr

. 
. 
. 
. *Impact on the cost of going to college of not having a parent who went to college in kilometers: 

. 
. di -_b[parentcollege]/_b[dist]
{res}90.449378

{com}. 
. 
. 
. *counterfactual 1: distance set to 0

. 
. est restore college
{txt}(results {stata estimates replay college:college} are active now)

{com}. 
. 
. 
. gen college_pr_static_counter1=invlogit(_b[_cons]+_b[male]*male ///
{err}too few ')' or ']'
{txt}{search r(132), local:r(132);}

{com}. 
. +_b[ability_math]*ability_math+_b[ability_language]*ability_language ///
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. +_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. /*
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. *Alternative (can be useful for bigger models):

. 
. clonevar dist_clone=dist//copy the variable you want to change
{err}varlist not allowed
{txt}{search r(101), local:r(101);}

{com}. 
. replace dist=0//set to counterfactual value
{err}0/ invalid name
{txt}{search r(198), local:r(198);}

{com}. 
. predict college_pr_static_counter1//use predict command
{err}varlist not allowed
{txt}{search r(101), local:r(101);}

{com}. 
. replace dist=dist_clone//set back to actual value
{err}dist_clone/ invalid name
{txt}{search r(198), local:r(198);}

{com}. 
. drop dist_clone//remove the copy
{err}variable {bf}dist_clone{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. */

. 
. 
. 
. gen college_pr_static_total_counter1=hs_static_pr*degree_pr*college_pr_static_counter1
{err}college_pr_static_counter1 not found
{txt}{search r(111), local:r(111);}

{com}. 
. 
. 
. gen stat_effect1=college_pr_static_total_counter1 ///
{err}invalid syntax
{txt}{search r(198), local:r(198);}

{com}. 
. - college_pr_static_total
{bf}{err}-{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. sum college_pr_static_total college_pr_static_total_counter1 stat_effect1  if period==1
{err}variable {bf}college_pr_static_total_counter1{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. //decrease in the college enrollment rate of 0.979 %points (or a relative change of 1.682%)
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. *counterfactual 2: 50% allowed in college

. 
. gen college_pr_static_total_counter2=hs_static_pr*degree_pr*0.5*college_pr

. 
. 
. 
. gen stat_effect2=college_pr_static_total_counter2 ///
{err}invalid syntax
{txt}{search r(198), local:r(198);}

{com}. 
. - college_pr_static_total
{bf}{err}-{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. sum college_pr_static_total college_pr_static_total_counter2 stat_effect2 if period==1
{err}variable {bf}stat_effect2{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. //decrease in the college enrollment rate of 29.098 %points (relative = 50%)
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. *3) A dynamic discrete choice model

. 
. *calculate the expected value of behaving optimally in the period 2

. 
. est restore college //results in college period remain valid
{err}in range not allowed
{txt}{search r(101), local:r(101);}

{com}. 
. 
. 
. gen u_college=_b[_cons]+_b[male]*male ///
{err}invalid syntax
{txt}{search r(198), local:r(198);}

{com}. 
. +_b[ability_math]*ability_math+_b[ability_language]*ability_language ///
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. +_b[parentcollege]*parentcollege +_b[dist]*dist
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. /*
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. *Alternative:

. 
. predict u_college, xb

. 
. */

. 
. 
. 
. gen emax=0.5772156649 ///
{err}invalid syntax
{txt}{search r(198), local:r(198);}

{com}. 
. +degree_pr*ln(exp(0)+exp(u_college)) ///
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. +(1-degree_pr)*ln(exp(0)) //this term is actually 0 so can leave it out
{bf}{err}+{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. /*
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. Note: 0.5772156649 is the Euler constant. You can also leave it out, which 
{err}command {bf}Note{sf} not defined by Note.ado
{txt}{search r(199), local:r(199);}

{com}. 
. changes your interpretation of the constant in the utility function (but
{err}command {bf}changes{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. 
. doesn't impact counterfactual simulations). However, do not only include it 
{err}command {bf}doesn{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. 
. after "degree_pr" as you also receive it if you do not get the degree.
{err}command {bf}after{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. 
. */

. 
. 
. 
. *high school stage

. 
. constraint 1 emax=0.95

. 
. logit school male ability_math ability_language parentcollege emax if period==1 , constraint(1)
{err}variable {bf}emax{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. est store hs_dynamic

. 
. predict hs_dynamic_pr
{txt}(option {bf:pr} assumed; Pr(school))

{com}. 
. 
. 
. gen college_pr_dynamic_total=hs_dynamic_pr*degree_pr*college_pr if period==2
{txt}(5,158 missing values generated)

{com}. 
. sum school college_pr_dynamic_total  if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}co~mic_total {c |}{res}      5,158    .4909067    .3256505   .0003203   .9906577

{com}. b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist*0
{err}command {bf}b{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. di _b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist*0
{res}1.9212751

{com}. di _b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*(dist*0)
{res}1.9212751

{com}. // Environment
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
.     clear all
{res}
{com}. 
. cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution

{com}. 
. use "data_assignment.dta", clear

. 
. 
. 
. log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. 
. 
. 
. 
. 
. // Question 1
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. ***************Period 1******************

. 
. sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1

. 
. 
. 
. 
. 
. corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000


{com}. 
. eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. 
. 
. ***************Period 2****************** add dist

. 
. 
. 
. sum male ability_math ability_language parentcollege school degree distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2

. 
. 
. 
. corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000


{com}. 
. eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 

. 
. 
. 
. 
. 
. **************Latex Table Produce

. 
. 
. 
. esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}. 
. esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}. 
. esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}. 
. esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}. 
. 
. 
. 
. // Question 2
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. // Question 2.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. ***************Period 1******************

. 
. 
. 
. ***************HighSchool Decision********

. 
. capture drop ST_HS_Prob

. 
. mlogit school male ability_math ability_language parentcollege if period==1,base(0)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2}-.9491516{col 30}{space 2} .1106502{col 41}{space 1}   -8.58{col 50}{space 3}0.000{col 58}{space 4}-1.166022{col 71}{space 3}-.7322812
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .5250864{col 30}{space 2} .0807139{col 41}{space 1}    6.51{col 50}{space 3}0.000{col 58}{space 4} .3668901{col 71}{space 3} .6832828
{txt}ability_language {c |}{col 18}{res}{space 2} .7062783{col 30}{space 2} .0812405{col 41}{space 1}    8.69{col 50}{space 3}0.000{col 58}{space 4} .5470499{col 71}{space 3} .8655067
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9583825{col 30}{space 2} .1899294{col 41}{space 1}    5.05{col 50}{space 3}0.000{col 58}{space 4} .5861277{col 71}{space 3} 1.330637
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 3.096661{col 30}{space 2} .1038889{col 41}{space 1}   29.81{col 50}{space 3}0.000{col 58}{space 4} 2.893042{col 71}{space 3} 3.300279
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HS

. 
. predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HS: quietly mlogit  school male ability_math ability_language parentcollege if period==1,base(0)

. 
. 
. 
. ***************HighSchoolDegree Probability**

. 
. capture drop ST_HSDegree_Prob

. 
. mlogit degree male ability_math ability_language parentcollege if period==1 & school==1,base(0)

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2}-.4807057{col 30}{space 2} .0971424{col 41}{space 1}   -4.95{col 50}{space 3}0.000{col 58}{space 4}-.6711013{col 71}{space 3}  -.29031
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .6448108{col 30}{space 2} .0749611{col 41}{space 1}    8.60{col 50}{space 3}0.000{col 58}{space 4} .4978896{col 71}{space 3} .7917319
{txt}ability_language {c |}{col 18}{res}{space 2} .8998475{col 30}{space 2} .0764428{col 41}{space 1}   11.77{col 50}{space 3}0.000{col 58}{space 4} .7500223{col 71}{space 3} 1.049673
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} 1.049599{col 30}{space 2} .1597167{col 41}{space 1}    6.57{col 50}{space 3}0.000{col 58}{space 4} .7365598{col 71}{space 3} 1.362638
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 2.217168{col 30}{space 2} .0812127{col 41}{space 1}   27.30{col 50}{space 3}0.000{col 58}{space 4} 2.057994{col 71}{space 3} 2.376341
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HSDegree

. 
. predict ST_HSDegree_Prob 
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HSDe: quietly mlogit degree male ability_math ability_language parentcollege if period==1 & school==1,base(0)

. 
. ***************Period 2******************

. 
. 
. 
. ***************College Decision********

. 
. capture drop ST_Col_Prob

. 
. mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1,base(0)

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2}-.6344893{col 30}{space 2} .0866098{col 41}{space 1}   -7.33{col 50}{space 3}0.000{col 58}{space 4}-.8042414{col 71}{space 3}-.4647373
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .7953581{col 30}{space 2}  .074274{col 41}{space 1}   10.71{col 50}{space 3}0.000{col 58}{space 4} .6497838{col 71}{space 3} .9409325
{txt}ability_language {c |}{col 18}{res}{space 2} .9388417{col 30}{space 2}  .075427{col 41}{space 1}   12.45{col 50}{space 3}0.000{col 58}{space 4} .7910074{col 71}{space 3} 1.086676
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9697686{col 30}{space 2} .1099471{col 41}{space 1}    8.82{col 50}{space 3}0.000{col 58}{space 4} .7542763{col 71}{space 3} 1.185261
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0107217{col 30}{space 2} .0083939{col 41}{space 1}   -1.28{col 50}{space 3}0.201{col 58}{space 4}-.0271734{col 71}{space 3} .0057301
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 1.125917{col 30}{space 2} .0955432{col 41}{space 1}   11.78{col 50}{space 3}0.000{col 58}{space 4} .9386556{col 71}{space 3} 1.313178
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_Col

. 
. predict ST_Col_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period2_Col: quietly mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1,base(0)

. 
. 
. 
. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted 
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. 
. 
. 
. // Question 2.d 
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. display -_b[parentcollege]/_b[dist]
{res}.

{com}. 
. 
. 
. // Question 2.e and f
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. 
. 
. ***************Benchmark***************

. 
. 
. 
. * College Enrollement Benchmark: presented in probability of going to college

. 
. 
. 
. gen ST_ColEnr_BM =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)

. 
. 
. 
. ***************Counterfactual 1********

. 
. *** dist*0=0

. 
. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 

. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)

. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5

. 
. 
. 
. ************Latex table output

. 
. 
. 
. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM

. 
. gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM

. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM

. 
. gen ST_ColEnr_DiffRatio_BM_CF2 = ( ST_ColEnr_CF2- ST_ColEnr_BM)/ST_ColEnr_BM

. 
. 
. 
. 
. eststo sum_ColEnr_period1: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==1

. 
. eststo sum_ColEnr_period2: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==2

. 
. esttab sum_ColEnr_period1  sum_ColEnr_period2  using "Part1_SumColEnrTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumColEnrTable.tex"'})

{com}. 
. 
. est restore ST_Col 
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
.     gen eulerC = -digamma(1)

. gen v_i12_De=_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist

. replace v_i12_De=_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist
{txt}(0 real changes made)

{com}. di _b[_cons]
{res}0

{com}. est res ST_Col 
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. estimates replay ST_Col

{txt}{hline}
{p 0 8}Model {hi:ST_Col}{p_end}
{hline}

Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2}-.6344893{col 30}{space 2} .0866098{col 41}{space 1}   -7.33{col 50}{space 3}0.000{col 58}{space 4}-.8042414{col 71}{space 3}-.4647373
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .7953581{col 30}{space 2}  .074274{col 41}{space 1}   10.71{col 50}{space 3}0.000{col 58}{space 4} .6497838{col 71}{space 3} .9409325
{txt}ability_language {c |}{col 18}{res}{space 2} .9388417{col 30}{space 2}  .075427{col 41}{space 1}   12.45{col 50}{space 3}0.000{col 58}{space 4} .7910074{col 71}{space 3} 1.086676
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9697686{col 30}{space 2} .1099471{col 41}{space 1}    8.82{col 50}{space 3}0.000{col 58}{space 4} .7542763{col 71}{space 3} 1.185261
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0107217{col 30}{space 2} .0083939{col 41}{space 1}   -1.28{col 50}{space 3}0.201{col 58}{space 4}-.0271734{col 71}{space 3} .0057301
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 1.125917{col 30}{space 2} .0955432{col 41}{space 1}   11.78{col 50}{space 3}0.000{col 58}{space 4} .9386556{col 71}{space 3} 1.313178
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. di _b[_cons]
{res}0

{com}. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 
{err}variable {bf}ST_Col_Prob_CF1{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)
{err}variable {bf}ST_ColEnr_CF1{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5
{err}variable {bf}ST_ColEnr_CF2{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. 
. 
. ************Latex table output

. 
. 
. 
. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM
{err}variable {bf}ST_ColEnr_Diff_BM_CF1{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM
{err}variable {bf}ST_ColEnr_DiffRatio_BM_CF1{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM
{err}variable {bf}ST_ColEnr_Diff_BM_CF2{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. gen ST_ColEnr_DiffRatio_BM_CF2 = ( ST_ColEnr_CF2- ST_ColEnr_BM)/ST_ColEnr_BM
{err}variable {bf}ST_ColEnr_DiffRatio_BM_CF2{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. 
. 
. 
. eststo sum_ColEnr_period1: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==1

. 
. eststo sum_ColEnr_period2: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==2

. 
. esttab sum_ColEnr_period1  sum_ColEnr_period2  using "Part1_SumColEnrTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumColEnrTable.tex"'})

{com}. // Environment
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
.     clear all
{res}
{com}. 
. cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution

{com}. 
. use "data_assignment.dta", clear

. 
. 
. 
. log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. 
. 
. 
. 
. 
. // Question 1
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. ***************Period 1******************

. 
. sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1

. 
. 
. 
. 
. 
. corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000


{com}. 
. eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. 
. 
. ***************Period 2****************** add dist

. 
. 
. 
. sum male ability_math ability_language parentcollege school degree distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2

. 
. 
. 
. corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000


{com}. 
. eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 

. 
. 
. 
. 
. 
. **************Latex Table Produce

. 
. 
. 
. esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}. 
. esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}. 
. esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}. 
. esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}. 
. 
. 
. 
. // Question 2
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. // Question 2.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. ***************Period 1******************

. 
. 
. 
. ***************HighSchool Decision********

. 
. capture drop ST_HS_Prob

. 
. mlogit school male ability_math ability_language parentcollege if period==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .9491516{col 30}{space 2} .1106502{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4} .7322812{col 71}{space 3} 1.166022
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.5250864{col 30}{space 2} .0807139{col 41}{space 1}   -6.51{col 50}{space 3}0.000{col 58}{space 4}-.6832828{col 71}{space 3}-.3668901
{txt}ability_language {c |}{col 18}{res}{space 2}-.7062783{col 30}{space 2} .0812405{col 41}{space 1}   -8.69{col 50}{space 3}0.000{col 58}{space 4}-.8655067{col 71}{space 3}-.5470499
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9583825{col 30}{space 2} .1899294{col 41}{space 1}   -5.05{col 50}{space 3}0.000{col 58}{space 4}-1.330637{col 71}{space 3}-.5861277
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-3.096661{col 30}{space 2} .1038889{col 41}{space 1}  -29.81{col 50}{space 3}0.000{col 58}{space 4}-3.300279{col 71}{space 3}-2.893042
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HS

. 
. predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HS: quietly mlogit  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. ***************HighSchoolDegree Probability**

. 
. capture drop ST_HSDegree_Prob

. 
. mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .4807057{col 30}{space 2} .0971424{col 41}{space 1}    4.95{col 50}{space 3}0.000{col 58}{space 4}   .29031{col 71}{space 3} .6711013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.6448108{col 30}{space 2} .0749611{col 41}{space 1}   -8.60{col 50}{space 3}0.000{col 58}{space 4}-.7917319{col 71}{space 3}-.4978896
{txt}ability_language {c |}{col 18}{res}{space 2}-.8998475{col 30}{space 2} .0764428{col 41}{space 1}  -11.77{col 50}{space 3}0.000{col 58}{space 4}-1.049673{col 71}{space 3}-.7500223
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.049599{col 30}{space 2} .1597167{col 41}{space 1}   -6.57{col 50}{space 3}0.000{col 58}{space 4}-1.362638{col 71}{space 3}-.7365598
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-2.217168{col 30}{space 2} .0812127{col 41}{space 1}  -27.30{col 50}{space 3}0.000{col 58}{space 4}-2.376341{col 71}{space 3}-2.057994
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HSDegree

. 
. predict ST_HSDegree_Prob 
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HSDe: quietly mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. ***************Period 2******************

. 
. 
. 
. ***************College Decision********

. 
. capture drop ST_Col_Prob

. 
. mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .6344893{col 30}{space 2} .0866098{col 41}{space 1}    7.33{col 50}{space 3}0.000{col 58}{space 4} .4647373{col 71}{space 3} .8042414
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.7953581{col 30}{space 2}  .074274{col 41}{space 1}  -10.71{col 50}{space 3}0.000{col 58}{space 4}-.9409325{col 71}{space 3}-.6497838
{txt}ability_language {c |}{col 18}{res}{space 2}-.9388417{col 30}{space 2}  .075427{col 41}{space 1}  -12.45{col 50}{space 3}0.000{col 58}{space 4}-1.086676{col 71}{space 3}-.7910074
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9697686{col 30}{space 2} .1099471{col 41}{space 1}   -8.82{col 50}{space 3}0.000{col 58}{space 4}-1.185261{col 71}{space 3}-.7542763
{txt}{space 12}dist {c |}{col 18}{res}{space 2} .0107217{col 30}{space 2} .0083939{col 41}{space 1}    1.28{col 50}{space 3}0.201{col 58}{space 4}-.0057301{col 71}{space 3} .0271734
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.125917{col 30}{space 2} .0955432{col 41}{space 1}  -11.78{col 50}{space 3}0.000{col 58}{space 4}-1.313178{col 71}{space 3}-.9386556
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_Col

. 
. predict ST_Col_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period2_Col: quietly mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

. 
. 
. 
. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted 
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. 
. 
. 
. // Question 2.d 
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. display -_b[parentcollege]/_b[dist]
{res}90.449378

{com}. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. gen ST_ColEnr_BM =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)

. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 

. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)

. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5

. run "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM
{err}ST_ColEnr_CF1 not found
{txt}{search r(111), local:r(111);}

{com}. 
. // gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM
{err}ST_ColEnr_CF2 not found
{txt}{search r(111), local:r(111);}

{com}. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)
{err}ST_HS_Prob not found
{txt}{search r(111), local:r(111);}

{com}. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5
{err}ST_HS_Prob not found
{txt}{search r(111), local:r(111);}

{com}. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 
{bf}{err}_b{sf} not allowed when {bf:e(b)} is not present
{txt}{search r(111), local:r(111);}

{com}. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)
{err}ST_HS_Prob not found
{txt}{search r(111), local:r(111);}

{com}. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5
{err}ST_HS_Prob not found
{txt}{search r(111), local:r(111);}

{com}. // Environment
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
.     clear all
{res}
{com}. 
. cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution

{com}. 
. use "data_assignment.dta", clear

. 
. 
. 
. log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. 
. 
. 
. 
. 
. // Question 1
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. ***************Period 1******************

. 
. sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1

. 
. 
. 
. 
. 
. corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000


{com}. 
. eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. 
. 
. ***************Period 2****************** add dist

. 
. 
. 
. sum male ability_math ability_language parentcollege school degree distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2

. 
. 
. 
. corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000


{com}. 
. eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 

. 
. 
. 
. 
. 
. **************Latex Table Produce

. 
. 
. 
. esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}. 
. esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}. 
. esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}. 
. esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}. 
. 
. 
. 
. 
. // Question 2
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. // Question 2.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. ***************Period 1******************

. 
. 
. 
. ***************HighSchool Decision********

. 
. capture drop ST_HS_Prob

. 
. mlogit school male ability_math ability_language parentcollege if period==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .9491516{col 30}{space 2} .1106502{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4} .7322812{col 71}{space 3} 1.166022
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.5250864{col 30}{space 2} .0807139{col 41}{space 1}   -6.51{col 50}{space 3}0.000{col 58}{space 4}-.6832828{col 71}{space 3}-.3668901
{txt}ability_language {c |}{col 18}{res}{space 2}-.7062783{col 30}{space 2} .0812405{col 41}{space 1}   -8.69{col 50}{space 3}0.000{col 58}{space 4}-.8655067{col 71}{space 3}-.5470499
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9583825{col 30}{space 2} .1899294{col 41}{space 1}   -5.05{col 50}{space 3}0.000{col 58}{space 4}-1.330637{col 71}{space 3}-.5861277
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-3.096661{col 30}{space 2} .1038889{col 41}{space 1}  -29.81{col 50}{space 3}0.000{col 58}{space 4}-3.300279{col 71}{space 3}-2.893042
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HS

. 
. predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HS: quietly mlogit  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. ***************HighSchoolDegree Probability**

. 
. capture drop ST_HSDegree_Prob

. 
. mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .4807057{col 30}{space 2} .0971424{col 41}{space 1}    4.95{col 50}{space 3}0.000{col 58}{space 4}   .29031{col 71}{space 3} .6711013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.6448108{col 30}{space 2} .0749611{col 41}{space 1}   -8.60{col 50}{space 3}0.000{col 58}{space 4}-.7917319{col 71}{space 3}-.4978896
{txt}ability_language {c |}{col 18}{res}{space 2}-.8998475{col 30}{space 2} .0764428{col 41}{space 1}  -11.77{col 50}{space 3}0.000{col 58}{space 4}-1.049673{col 71}{space 3}-.7500223
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.049599{col 30}{space 2} .1597167{col 41}{space 1}   -6.57{col 50}{space 3}0.000{col 58}{space 4}-1.362638{col 71}{space 3}-.7365598
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-2.217168{col 30}{space 2} .0812127{col 41}{space 1}  -27.30{col 50}{space 3}0.000{col 58}{space 4}-2.376341{col 71}{space 3}-2.057994
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HSDegree

. 
. predict ST_HSDegree_Prob 
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HSDe: quietly mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. ***************Period 2******************

. 
. 
. 
. ***************College Decision********

. 
. capture drop ST_Col_Prob

. 
. mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .6344893{col 30}{space 2} .0866098{col 41}{space 1}    7.33{col 50}{space 3}0.000{col 58}{space 4} .4647373{col 71}{space 3} .8042414
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.7953581{col 30}{space 2}  .074274{col 41}{space 1}  -10.71{col 50}{space 3}0.000{col 58}{space 4}-.9409325{col 71}{space 3}-.6497838
{txt}ability_language {c |}{col 18}{res}{space 2}-.9388417{col 30}{space 2}  .075427{col 41}{space 1}  -12.45{col 50}{space 3}0.000{col 58}{space 4}-1.086676{col 71}{space 3}-.7910074
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9697686{col 30}{space 2} .1099471{col 41}{space 1}   -8.82{col 50}{space 3}0.000{col 58}{space 4}-1.185261{col 71}{space 3}-.7542763
{txt}{space 12}dist {c |}{col 18}{res}{space 2} .0107217{col 30}{space 2} .0083939{col 41}{space 1}    1.28{col 50}{space 3}0.201{col 58}{space 4}-.0057301{col 71}{space 3} .0271734
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.125917{col 30}{space 2} .0955432{col 41}{space 1}  -11.78{col 50}{space 3}0.000{col 58}{space 4}-1.313178{col 71}{space 3}-.9386556
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_Col

. 
. predict ST_Col_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period2_Col: quietly mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

. 
. 
. 
. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted 
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. 
. 
. 
. // Question 2.d 
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. display -_b[parentcollege]/_b[dist]
{res}90.449378

{com}. 
. 
. 
. // Question 2.e and f
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. 
. 
. ***************Benchmark***************

. 
. 
. 
. * College Enrollement Benchmark: presented in probability of going to college

. 
. 
. 
. gen ST_ColEnr_BM =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)

. 
. 
. 
. ***************Counterfactual 1********

. 
. *** dist*0=0

. 
. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 

. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)

. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5

. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM

. 
. // gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM

. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.                 gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM
{err}variable {bf}ST_ColEnr_Diff_BM_CF1{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.                 eststo sum_ColEnr_period1: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==1
{txt}
{com}.                 eststo sum_ColEnr_period2: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==2
{txt}
{com}.                 esttab sum_ColEnr_period1  sum_ColEnr_period2  using "Part1_SumColEnrTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumColEnrTable.tex"'})

{com}. 
{txt}end of do-file

{com}. gen v_i12_De=_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist
{bf}{err}_b{sf} not allowed when {bf:e(b)} is not present
{txt}{search r(111), local:r(111);}

{com}. 
. gen v_i02_De=0

. 
. gen v_i2_NonDe =0

. // Environment
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
.     clear all
{res}
{com}. 
. cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution

{com}. 
. use "data_assignment.dta", clear

. 
. 
. 
. log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. 
. 
. 
. 
. 
. // Question 1
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. ***************Period 1******************

. 
. sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1

. 
. 
. 
. 
. 
. corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000


{com}. 
. eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. 
. 
. ***************Period 2****************** add dist

. 
. 
. 
. sum male ability_math ability_language parentcollege school degree distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2

. 
. 
. 
. corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000


{com}. 
. eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 

. 
. 
. 
. 
. 
. **************Latex Table Produce

. 
. 
. 
. esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}. 
. esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}. 
. esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}. 
. esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}. 
. 
. 
. 
. 
. // Question 2
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. // Question 2.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. ***************Period 1******************

. 
. 
. 
. ***************HighSchool Decision********

. 
. capture drop ST_HS_Prob

. 
. mlogit school male ability_math ability_language parentcollege if period==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .9491516{col 30}{space 2} .1106502{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4} .7322812{col 71}{space 3} 1.166022
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.5250864{col 30}{space 2} .0807139{col 41}{space 1}   -6.51{col 50}{space 3}0.000{col 58}{space 4}-.6832828{col 71}{space 3}-.3668901
{txt}ability_language {c |}{col 18}{res}{space 2}-.7062783{col 30}{space 2} .0812405{col 41}{space 1}   -8.69{col 50}{space 3}0.000{col 58}{space 4}-.8655067{col 71}{space 3}-.5470499
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9583825{col 30}{space 2} .1899294{col 41}{space 1}   -5.05{col 50}{space 3}0.000{col 58}{space 4}-1.330637{col 71}{space 3}-.5861277
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-3.096661{col 30}{space 2} .1038889{col 41}{space 1}  -29.81{col 50}{space 3}0.000{col 58}{space 4}-3.300279{col 71}{space 3}-2.893042
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HS

. 
. predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HS: quietly mlogit  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. ***************HighSchoolDegree Probability**

. 
. capture drop ST_HSDegree_Prob

. 
. mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .4807057{col 30}{space 2} .0971424{col 41}{space 1}    4.95{col 50}{space 3}0.000{col 58}{space 4}   .29031{col 71}{space 3} .6711013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.6448108{col 30}{space 2} .0749611{col 41}{space 1}   -8.60{col 50}{space 3}0.000{col 58}{space 4}-.7917319{col 71}{space 3}-.4978896
{txt}ability_language {c |}{col 18}{res}{space 2}-.8998475{col 30}{space 2} .0764428{col 41}{space 1}  -11.77{col 50}{space 3}0.000{col 58}{space 4}-1.049673{col 71}{space 3}-.7500223
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.049599{col 30}{space 2} .1597167{col 41}{space 1}   -6.57{col 50}{space 3}0.000{col 58}{space 4}-1.362638{col 71}{space 3}-.7365598
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-2.217168{col 30}{space 2} .0812127{col 41}{space 1}  -27.30{col 50}{space 3}0.000{col 58}{space 4}-2.376341{col 71}{space 3}-2.057994
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HSDegree

. 
. predict ST_HSDegree_Prob 
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HSDe: quietly mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. ***************Period 2******************

. 
. 
. 
. ***************College Decision********

. 
. capture drop ST_Col_Prob

. 
. mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .6344893{col 30}{space 2} .0866098{col 41}{space 1}    7.33{col 50}{space 3}0.000{col 58}{space 4} .4647373{col 71}{space 3} .8042414
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.7953581{col 30}{space 2}  .074274{col 41}{space 1}  -10.71{col 50}{space 3}0.000{col 58}{space 4}-.9409325{col 71}{space 3}-.6497838
{txt}ability_language {c |}{col 18}{res}{space 2}-.9388417{col 30}{space 2}  .075427{col 41}{space 1}  -12.45{col 50}{space 3}0.000{col 58}{space 4}-1.086676{col 71}{space 3}-.7910074
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9697686{col 30}{space 2} .1099471{col 41}{space 1}   -8.82{col 50}{space 3}0.000{col 58}{space 4}-1.185261{col 71}{space 3}-.7542763
{txt}{space 12}dist {c |}{col 18}{res}{space 2} .0107217{col 30}{space 2} .0083939{col 41}{space 1}    1.28{col 50}{space 3}0.201{col 58}{space 4}-.0057301{col 71}{space 3} .0271734
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.125917{col 30}{space 2} .0955432{col 41}{space 1}  -11.78{col 50}{space 3}0.000{col 58}{space 4}-1.313178{col 71}{space 3}-.9386556
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_Col

. 
. predict ST_Col_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period2_Col: quietly mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

. 
. 
. 
. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted 
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. 
. 
. 
. // Question 2.d 
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. display -_b[parentcollege]/_b[dist]
{res}90.449378

{com}. 
. 
. 
. // Question 2.e and f
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. 
. 
. ***************Benchmark***************

. 
. 
. 
. * College Enrollement Benchmark: presented in probability of going to college

. 
. 
. 
. gen ST_ColEnr_BM =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)

. 
. 
. 
. ***************Counterfactual 1********

. 
. *** dist*0=0

. 
. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 

. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)

. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5

. 
. 
. 
. ************Latex table output

. 
. 
. 
. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM

. 
. // gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM

. 
. // gen ST_ColEnr_DiffRatio_BM_CF2 = ( ST_ColEnr_CF2- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. eststo sum_ColEnr_period1: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==1

. 
. eststo sum_ColEnr_period2: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==2

. 
. esttab sum_ColEnr_period1  sum_ColEnr_period2  using "Part1_SumColEnrTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumColEnrTable.tex"'})

{com}. 
. 
. 
. 
. 
.     // Question 3
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
.     // Question 3.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. gen eulerC = -digamma(1)

. 
. 
. 
. estimates restore ST_Col 
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen v_i12_De= _b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist

. 
. gen v_i02_De=0

. 
. gen v_i2_NonDe =0

. gen v_i12_De= -(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist)
{err}variable {bf}v_i12_De{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. replace -(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist)
{err}factor-variable and time-series operators not allowed
{txt}{search r(101), local:r(101);}

{com}. gen v_i12_De= -(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist),replace
{err}variable {bf}v_i12_De{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. drop v_i12_De

. gen v_i12_De= -(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist)

. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.                 gen Exp_V2_d1_HS= ST_HSDegree_Prob*(eulerC+ln(exp(v_i12_De)+exp(v_i02_De)))     +(1-ST_HSDegree_Prob)*(eulerC+ln(exp(v_i2_NonDe)) )
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.                 constraint 1 Exp_V2_d1_HS=0.95
{txt}
{com}.                 mlogit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -1722.461}  
Iteration 1:{space 3}log likelihood = {res:-1329.8006}  
Iteration 2:{space 3}log likelihood = {res:-1296.5194}  
Iteration 3:{space 3}log likelihood = {res:-1296.1477}  
Iteration 4:{space 3}log likelihood = {res:-1296.1471}  
Iteration 5:{space 3}log likelihood = {res:-1296.1471}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}    480.24
{txt}Log likelihood = {res}-1296.1471{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [0]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .9594021{col 30}{space 2} .1105905{col 41}{space 1}    8.68{col 50}{space 3}0.000{col 58}{space 4} .7426487{col 71}{space 3} 1.176156
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.5392694{col 30}{space 2} .0806281{col 41}{space 1}   -6.69{col 50}{space 3}0.000{col 58}{space 4}-.6972975{col 71}{space 3}-.3812413
{txt}ability_language {c |}{col 18}{res}{space 2}-.7115197{col 30}{space 2}  .081275{col 41}{space 1}   -8.75{col 50}{space 3}0.000{col 58}{space 4}-.8708157{col 71}{space 3}-.5522237
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9249563{col 30}{space 2} .1899827{col 41}{space 1}   -4.87{col 50}{space 3}0.000{col 58}{space 4}-1.297315{col 71}{space 3}-.5525972
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2}-3.769568{col 30}{space 2} .1042056{col 41}{space 1}  -36.17{col 50}{space 3}0.000{col 58}{space 4}-3.973807{col 71}{space 3}-3.565329
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.                 est sto DY_HS
{txt}
{com}.                 predict DY_HS_Prob
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.                 gen DY_ColEnr_BM =(1-DY_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob) 
{txt}
{com}.                 sum school DY_ColEnr_BM  if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}DY_ColEnr_BM {c |}{res}      5,158    .5820054    .3099282   .0035112   .9931551
{txt}
{com}. 
{txt}end of do-file

{com}. gen DY_ColEnr_BM =(1-DY_HS_Prob)*(1-ST_HSDegree_Prob)*(1-DY_HS_Prob) 
{err}variable {bf}DY_ColEnr_BM{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. 
. sum school DY_ColEnr_BM  if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}DY_ColEnr_BM {c |}{res}      5,158    .5820054    .3099282   .0035112   .9931551

{com}. replace DY_ColEnr_BM =(1-DY_HS_Prob)*(1-ST_HSDegree_Prob)*(1-DY_HS_Prob)
{txt}(10,316 real changes made)

{com}. sum school DY_ColEnr_BM  if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}DY_ColEnr_BM {c |}{res}      5,158    .7297907    .2555638   .0381775   .9956594

{com}. // Environment
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
.     clear all
{res}
{com}. 
. cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution

{com}. 
. use "data_assignment.dta", clear

. 
. 
. 
. log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

{com}. 
. 
. 
. 
. 
. // Question 1
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. ***************Period 1******************

. 
. sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1

{com}. 
. eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1

. 
. 
. 
. 
. 
. corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000


{com}. 
. eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. 
. 
. ***************Period 2****************** add dist

. 
. 
. 
. sum male ability_math ability_language parentcollege school degree distif period==2
{err}variable {bf}distif{sf} not found
{txt}{search r(111), local:r(111);}

{com}. 
. eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2

. 
. 
. 
. corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000


{com}. 
. eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 

. 
. 
. 
. reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 
. eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 

. 
. 
. 
. 
. 
. **************Latex Table Produce

. 
. 
. 
. esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}. 
. esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}. 
. esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}. 
. esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}. 
. 
. 
. 
. 
. // Question 2
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. // Question 2.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. ***************Period 1******************

. 
. 
. 
. ***************HighSchool Decision********

. 
. capture drop ST_HS_Prob

. 
. mlogit school male ability_math ability_language parentcollege if period==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .9491516{col 30}{space 2} .1106502{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4} .7322812{col 71}{space 3} 1.166022
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.5250864{col 30}{space 2} .0807139{col 41}{space 1}   -6.51{col 50}{space 3}0.000{col 58}{space 4}-.6832828{col 71}{space 3}-.3668901
{txt}ability_language {c |}{col 18}{res}{space 2}-.7062783{col 30}{space 2} .0812405{col 41}{space 1}   -8.69{col 50}{space 3}0.000{col 58}{space 4}-.8655067{col 71}{space 3}-.5470499
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9583825{col 30}{space 2} .1899294{col 41}{space 1}   -5.05{col 50}{space 3}0.000{col 58}{space 4}-1.330637{col 71}{space 3}-.5861277
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-3.096661{col 30}{space 2} .1038889{col 41}{space 1}  -29.81{col 50}{space 3}0.000{col 58}{space 4}-3.300279{col 71}{space 3}-2.893042
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HS

. 
. predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HS: quietly mlogit  school male ability_math ability_language parentcollege if period==1

. 
. 
. 
. ***************HighSchoolDegree Probability**

. 
. capture drop ST_HSDegree_Prob

. 
. mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1896.8277}  
Iteration 1:{space 3}log likelihood = {res:-1513.9666}  
Iteration 2:{space 3}log likelihood = {res:-1443.1983}  
Iteration 3:{space 3}log likelihood = {res:-1440.9891}  
Iteration 4:{space 3}log likelihood = {res:-1440.9862}  
Iteration 5:{space 3}log likelihood = {res:-1440.9862}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,669
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    911.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1440.9862{txt}{col 49}Pseudo R2{col 67}= {res}    0.2403

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .4807057{col 30}{space 2} .0971424{col 41}{space 1}    4.95{col 50}{space 3}0.000{col 58}{space 4}   .29031{col 71}{space 3} .6711013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.6448108{col 30}{space 2} .0749611{col 41}{space 1}   -8.60{col 50}{space 3}0.000{col 58}{space 4}-.7917319{col 71}{space 3}-.4978896
{txt}ability_language {c |}{col 18}{res}{space 2}-.8998475{col 30}{space 2} .0764428{col 41}{space 1}  -11.77{col 50}{space 3}0.000{col 58}{space 4}-1.049673{col 71}{space 3}-.7500223
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.049599{col 30}{space 2} .1597167{col 41}{space 1}   -6.57{col 50}{space 3}0.000{col 58}{space 4}-1.362638{col 71}{space 3}-.7365598
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-2.217168{col 30}{space 2} .0812127{col 41}{space 1}  -27.30{col 50}{space 3}0.000{col 58}{space 4}-2.376341{col 71}{space 3}-2.057994
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_HSDegree

. 
. predict ST_HSDegree_Prob 
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period1_HSDe: quietly mlogit degree male ability_math ability_language parentcollege if period==1 & school==1

. 
. ***************Period 2******************

. 
. 
. 
. ***************College Decision********

. 
. capture drop ST_Col_Prob

. 
. mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res: -2264.835}  
Iteration 1:{space 3}log likelihood = {res:-1752.6334}  
Iteration 2:{space 3}log likelihood = {res:-1710.6512}  
Iteration 3:{space 3}log likelihood = {res:-1710.2932}  
Iteration 4:{space 3}log likelihood = {res: -1710.293}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     4,012
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1109.08
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1710.293{txt}{col 49}Pseudo R2{col 67}= {res}    0.2448

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} .6344893{col 30}{space 2} .0866098{col 41}{space 1}    7.33{col 50}{space 3}0.000{col 58}{space 4} .4647373{col 71}{space 3} .8042414
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.7953581{col 30}{space 2}  .074274{col 41}{space 1}  -10.71{col 50}{space 3}0.000{col 58}{space 4}-.9409325{col 71}{space 3}-.6497838
{txt}ability_language {c |}{col 18}{res}{space 2}-.9388417{col 30}{space 2}  .075427{col 41}{space 1}  -12.45{col 50}{space 3}0.000{col 58}{space 4}-1.086676{col 71}{space 3}-.7910074
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-.9697686{col 30}{space 2} .1099471{col 41}{space 1}   -8.82{col 50}{space 3}0.000{col 58}{space 4}-1.185261{col 71}{space 3}-.7542763
{txt}{space 12}dist {c |}{col 18}{res}{space 2} .0107217{col 30}{space 2} .0083939{col 41}{space 1}    1.28{col 50}{space 3}0.201{col 58}{space 4}-.0057301{col 71}{space 3} .0271734
{txt}{space 11}_cons {c |}{col 18}{res}{space 2}-1.125917{col 30}{space 2} .0955432{col 41}{space 1}  -11.78{col 50}{space 3}0.000{col 58}{space 4}-1.313178{col 71}{space 3}-.9386556
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto ST_Col

. 
. predict ST_Col_Prob  
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. eststo mlogit_period2_Col: quietly mlogit school male ability_math ability_language parentcollege dist if period==2 & degree==1

. 
. 
. 
. esttab mlogit_period1_HS mlogit_period1_HSDe mlogit_period2_Col using "Part2_mlogitTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se noomitted 
{res}{txt}(output written to {browse  `"Part2_mlogitTable.tex"'})

{com}. 
. 
. 
. // Question 2.d 
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. display -_b[parentcollege]/_b[dist]
{res}90.449378

{com}. 
. 
. 
. // Question 2.e and f
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. 
. 
. ***************Benchmark***************

. 
. 
. 
. * College Enrollement Benchmark: presented in probability of going to college

. 
. 
. 
. gen ST_ColEnr_BM =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)

. 
. 
. 
. ***************Counterfactual 1********

. 
. *** dist*0=0

. 
. estimates restore ST_Col
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen ST_Col_Prob_CF1=invlogit(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language+_b[parentcollege]*parentcollege +_b[dist]*(dist*0)) 

. 
. 
. 
. gen ST_ColEnr_CF1 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob_CF1)

. 
.   
. 
. **************Counterfactual 2****

. 
. gen ST_ColEnr_CF2 =(1-ST_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob)*0.5

. 
. 
. 
. ************Latex table output

. 
. 
. 
. gen ST_ColEnr_Diff_BM_CF1 = ST_ColEnr_CF1- ST_ColEnr_BM

. 
. // gen ST_ColEnr_DiffRatio_BM_CF1 = ( ST_ColEnr_CF1- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. gen ST_ColEnr_Diff_BM_CF2 = ST_ColEnr_CF2- ST_ColEnr_BM

. 
. // gen ST_ColEnr_DiffRatio_BM_CF2 = ( ST_ColEnr_CF2- ST_ColEnr_BM)/ST_ColEnr_BM
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. 
. 
. eststo sum_ColEnr_period1: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==1

. 
. eststo sum_ColEnr_period2: quietly estpost summarize ST_ColEnr_BM ST_ColEnr_Diff_BM_CF1 ST_ColEnr_Diff_BM_CF2 if period==2

. 
. esttab sum_ColEnr_period1  sum_ColEnr_period2  using "Part1_SumColEnrTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumColEnrTable.tex"'})

{com}. 
. 
. 
. 
. 
.     // Question 3
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
.     // Question 3.c
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199), local:r(199);}

{com}. 
. 
. 
. gen eulerC = -digamma(1)

. 
. 
. 
. estimates restore ST_Col 
{txt}(results {stata estimates replay ST_Col:ST_Col} are active now)

{com}. 
. 
. 
. gen v_i12_De= -(_b[_cons]+_b[male]*male+_b[ability_math]*ability_math+_b[ability_language]*ability_language +_b[parentcollege]*parentcollege +_b[dist]*dist)

. 
. gen v_i02_De=0

. 
. gen v_i2_NonDe =0

. 
. 
. 
. gen Exp_V2_d1_HS= (1-ST_HSDegree_Prob)*(eulerC+ln(exp(v_i12_De)+exp(v_i02_De))) +(ST_HSDegree_Prob)*(eulerC+ln(exp(v_i2_NonDe)) )

. 
. 
. 
. 
. 
. 
. 
. constraint 1 Exp_V2_d1_HS=0.95

. 
. mlogit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-4281.1062}  
Iteration 1:{space 3}log likelihood = {res:-1470.3425}  
Iteration 2:{space 3}log likelihood = {res:-1324.9711}  
Iteration 3:{space 3}log likelihood = {res:-1322.2739}  
Iteration 4:{space 3}log likelihood = {res:-1322.2694}  
Iteration 5:{space 3}log likelihood = {res:-1322.2694}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}   1416.02
{txt}Log likelihood = {res}-1322.2694{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [0]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} 1.243606{col 30}{space 2} .1117262{col 41}{space 1}   11.13{col 50}{space 3}0.000{col 58}{space 4} 1.024627{col 71}{space 3} 1.462585
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.8398136{col 30}{space 2} .0820414{col 41}{space 1}  -10.24{col 50}{space 3}0.000{col 58}{space 4}-1.000612{col 71}{space 3}-.6790155
{txt}ability_language {c |}{col 18}{res}{space 2}-1.115137{col 30}{space 2} .0812998{col 41}{space 1}  -13.72{col 50}{space 3}0.000{col 58}{space 4}-1.274482{col 71}{space 3}-.9557923
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.727874{col 30}{space 2} .1913979{col 41}{space 1}   -9.03{col 50}{space 3}0.000{col 58}{space 4}-2.103007{col 71}{space 3}-1.352741
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2}-4.853257{col 30}{space 2} .1012035{col 41}{space 1}  -47.96{col 50}{space 3}0.000{col 58}{space 4}-5.051613{col 71}{space 3}-4.654902
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. est sto DY_HS

. 
. predict DY_HS_Prob
{txt}(option {bf:pr} assumed; predicted probabilities)

{com}. 
. 
. 
. gen DY_ColEnr_BM =(1-DY_HS_Prob)*(1-ST_HSDegree_Prob)*(1-ST_Col_Prob) 

. 
. sum school DY_ColEnr_BM  if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}DY_ColEnr_BM {c |}{res}      5,158    .5815283    .3050396   .0024179   .9857946

{com}. mlogit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-4281.1062}  
Iteration 1:{space 3}log likelihood = {res:-1470.3425}  
Iteration 2:{space 3}log likelihood = {res:-1324.9711}  
Iteration 3:{space 3}log likelihood = {res:-1322.2739}  
Iteration 4:{space 3}log likelihood = {res:-1322.2694}  
Iteration 5:{space 3}log likelihood = {res:-1322.2694}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}   1416.02
{txt}Log likelihood = {res}-1322.2694{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [0]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} 1.243606{col 30}{space 2} .1117262{col 41}{space 1}   11.13{col 50}{space 3}0.000{col 58}{space 4} 1.024627{col 71}{space 3} 1.462585
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.8398136{col 30}{space 2} .0820414{col 41}{space 1}  -10.24{col 50}{space 3}0.000{col 58}{space 4}-1.000612{col 71}{space 3}-.6790155
{txt}ability_language {c |}{col 18}{res}{space 2}-1.115137{col 30}{space 2} .0812998{col 41}{space 1}  -13.72{col 50}{space 3}0.000{col 58}{space 4}-1.274482{col 71}{space 3}-.9557923
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.727874{col 30}{space 2} .1913979{col 41}{space 1}   -9.03{col 50}{space 3}0.000{col 58}{space 4}-2.103007{col 71}{space 3}-1.352741
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2}-4.853257{col 30}{space 2} .1012035{col 41}{space 1}  -47.96{col 50}{space 3}0.000{col 58}{space 4}-5.051613{col 71}{space 3}-4.654902
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. logit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1711.3922}  
Iteration 1:{space 3}log likelihood = {res:-1325.4506}  
Iteration 2:{space 3}log likelihood = {res:-1296.4425}  
Iteration 3:{space 3}log likelihood = {res:-1296.3792}  
Iteration 4:{space 3}log likelihood = {res:-1296.3791}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}    104.47
{txt}Log likelihood = {res}-1296.3791{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [school]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2} -.691289{col 30}{space 2} .1106333{col 41}{space 1}   -6.25{col 50}{space 3}0.000{col 58}{space 4}-.9081263{col 71}{space 3}-.4744517
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}  .235896{col 30}{space 2} .0802611{col 41}{space 1}    2.94{col 50}{space 3}0.003{col 58}{space 4} .0785872{col 71}{space 3} .3932048
{txt}ability_language {c |}{col 18}{res}{space 2} .3399407{col 30}{space 2} .0816341{col 41}{space 1}    4.16{col 50}{space 3}0.000{col 58}{space 4} .1799408{col 71}{space 3} .4999406
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .3152227{col 30}{space 2} .1911567{col 41}{space 1}    1.65{col 50}{space 3}0.099{col 58}{space 4}-.0594376{col 71}{space 3} .6898829
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2} 1.439664{col 30}{space 2}  .107669{col 41}{space 1}   13.37{col 50}{space 3}0.000{col 58}{space 4} 1.228637{col 71}{space 3} 1.650692
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto DY_HS

. 
. predict DY_HS_Prob
{err}variable {bf}DY_HS_Prob{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. logit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1711.3922}  
Iteration 1:{space 3}log likelihood = {res:-1325.4506}  
Iteration 2:{space 3}log likelihood = {res:-1296.4425}  
Iteration 3:{space 3}log likelihood = {res:-1296.3792}  
Iteration 4:{space 3}log likelihood = {res:-1296.3791}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}    104.47
{txt}Log likelihood = {res}-1296.3791{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [school]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2} -.691289{col 30}{space 2} .1106333{col 41}{space 1}   -6.25{col 50}{space 3}0.000{col 58}{space 4}-.9081263{col 71}{space 3}-.4744517
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}  .235896{col 30}{space 2} .0802611{col 41}{space 1}    2.94{col 50}{space 3}0.003{col 58}{space 4} .0785872{col 71}{space 3} .3932048
{txt}ability_language {c |}{col 18}{res}{space 2} .3399407{col 30}{space 2} .0816341{col 41}{space 1}    4.16{col 50}{space 3}0.000{col 58}{space 4} .1799408{col 71}{space 3} .4999406
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .3152227{col 30}{space 2} .1911567{col 41}{space 1}    1.65{col 50}{space 3}0.099{col 58}{space 4}-.0594376{col 71}{space 3} .6898829
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2} 1.439664{col 30}{space 2}  .107669{col 41}{space 1}   13.37{col 50}{space 3}0.000{col 58}{space 4} 1.228637{col 71}{space 3} 1.650692
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. mlogit school male ability_math ability_language parentcollege Exp_V2_d1_HS if period==1, constraint(1) 

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-4281.1062}  
Iteration 1:{space 3}log likelihood = {res:-1470.3425}  
Iteration 2:{space 3}log likelihood = {res:-1324.9711}  
Iteration 3:{space 3}log likelihood = {res:-1322.2739}  
Iteration 4:{space 3}log likelihood = {res:-1322.2694}  
Iteration 5:{space 3}log likelihood = {res:-1322.2694}  
{res}
{txt}Multinomial logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}Wald chi2({res}4{txt}){col 67}= {res}   1416.02
{txt}Log likelihood = {res}-1322.2694{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{p 0 7}{space 1}{text:( 1)}{space 1} [0]Exp_V2_d1_HS = .95{p_end}
{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0                {txt}{c |}
{space 12}male {c |}{col 18}{res}{space 2} 1.243606{col 30}{space 2} .1117262{col 41}{space 1}   11.13{col 50}{space 3}0.000{col 58}{space 4} 1.024627{col 71}{space 3} 1.462585
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2}-.8398136{col 30}{space 2} .0820414{col 41}{space 1}  -10.24{col 50}{space 3}0.000{col 58}{space 4}-1.000612{col 71}{space 3}-.6790155
{txt}ability_language {c |}{col 18}{res}{space 2}-1.115137{col 30}{space 2} .0812998{col 41}{space 1}  -13.72{col 50}{space 3}0.000{col 58}{space 4}-1.274482{col 71}{space 3}-.9557923
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2}-1.727874{col 30}{space 2} .1913979{col 41}{space 1}   -9.03{col 50}{space 3}0.000{col 58}{space 4}-2.103007{col 71}{space 3}-1.352741
{txt}{space 4}Exp_V2_d1_HS {c |}{col 18}{res}{space 2}      .95{col 30}{txt}  (constrained)
{space 11}_cons {c |}{col 18}{res}{space 2}-4.853257{col 30}{space 2} .1012035{col 41}{space 1}  -47.96{col 50}{space 3}0.000{col 58}{space 4}-5.051613{col 71}{space 3}-4.654902
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1               {col 18}{txt}{c |}  (base outcome)
{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.     clear all
{res}{txt}
{com}.         cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution
{txt}
{com}.         use "data_assignment.dta", clear
{txt}
{com}. 
.         log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.     clear all
{res}{txt}
{com}.         cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution
{txt}
{com}.         use "data_assignment.dta", clear
{txt}
{com}. 
.         log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}. 
.         ***************Period 1******************
.                 sum male ability_math ability_language parentcollege school degree  if period==1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .9051958    .2929727          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1
{txt}
{com}.                 eststo sum_period1: quietly estpost summarize male ability_math ability_language parentcollege school degree  if period==1
{txt}
{com}.                 
.                 
.                 corr male ability_math ability_language parentcollege school degree if period==1
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree
{hline 13}{c +}{hline 54}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1319   0.2883   0.3083   0.1510   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6055   1.0000

{txt}
{com}.                 eststo corr_period1: quietly estpost corr male ability_math ability_language parentcollege school degree  if period==1,matrix 
{txt}
{com}.                 
.                 reg school male ability_math ability_language parentcollege if period==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     5,158
{txt}{hline 13}{c +}{hline 34}   F(4, 5153)      = {res}   174.27
{txt}       Model {c |} {res} 52.7439438         4   13.185986   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 389.896808     5,153  .075664042   {txt}R-squared       ={res}    0.1192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 442.640752     5,157  .085832994   {txt}Root MSE        =   {res} .27507

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0701246{col 30}{space 2} .0077228{col 41}{space 1}   -9.08{col 50}{space 3}0.000{col 58}{space 4}-.0852645{col 71}{space 3}-.0549847
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0480834{col 30}{space 2} .0064086{col 41}{space 1}    7.50{col 50}{space 3}0.000{col 58}{space 4} .0355199{col 71}{space 3} .0606469
{txt}ability_language {c |}{col 18}{res}{space 2} .0551945{col 30}{space 2} .0061549{col 41}{space 1}    8.97{col 50}{space 3}0.000{col 58}{space 4} .0431282{col 71}{space 3} .0672608
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0292121{col 30}{space 2} .0091152{col 41}{space 1}    3.20{col 50}{space 3}0.001{col 58}{space 4} .0113425{col 71}{space 3} .0470818
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .9283076{col 30}{space 2} .0059492{col 41}{space 1}  156.04{col 50}{space 3}0.000{col 58}{space 4} .9166447{col 71}{space 3} .9399705
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.                 eststo reg_period1_HS: quietly regress  school male ability_math ability_language parentcollege if period==1
{txt}
{com}.                 
.                 reg degree male ability_math ability_language parentcollege if period==1 & school==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,669
{txt}{hline 13}{c +}{hline 34}   F(4, 4664)      = {res}   260.56
{txt}       Model {c |} {res} 103.115473         4  25.7788683   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 461.434537     4,664  .098935364   {txt}R-squared       ={res}    0.1827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1819
{txt}       Total {c |} {res} 564.550011     4,668  .120940448   {txt}Root MSE        =   {res} .31454

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          degree{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0506287{col 30}{space 2} .0092847{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4} -.068831{col 71}{space 3}-.0324263
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .0781606{col 30}{space 2} .0077882{col 41}{space 1}   10.04{col 50}{space 3}0.000{col 58}{space 4} .0628921{col 71}{space 3}  .093429
{txt}ability_language {c |}{col 18}{res}{space 2} .0907088{col 30}{space 2} .0074367{col 41}{space 1}   12.20{col 50}{space 3}0.000{col 58}{space 4} .0761293{col 71}{space 3} .1052882
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .0504741{col 30}{space 2} .0106442{col 41}{space 1}    4.74{col 50}{space 3}0.000{col 58}{space 4} .0296064{col 71}{space 3} .0713417
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .8474298{col 30}{space 2} .0070313{col 41}{space 1}  120.52{col 50}{space 3}0.000{col 58}{space 4} .8336451{col 71}{space 3} .8612145
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.                 eststo reg_period1_De: quietly regress  degree male ability_math ability_language parentcollege if period==1 & school==1
{txt}
{com}. 
.         ***************Period 2****************** add dist
. 
.                 sum male ability_math ability_language parentcollege school degree      dist    if period==2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}male {c |}{res}      5,158    .4955409    .5000286          0          1
{txt}ability_math {c |}{res}      5,158    .0443971    .8899971         -2          2
{txt}ability_la~e {c |}{res}      5,158    .0246219    .9382602         -2          2
{txt}parentcoll~e {c |}{res}      5,158    .2787902    .4484476          0          1
{txt}{space 6}school {c |}{res}      5,158    .5818147    .4933088          0          1
{txt}{hline 13}{c +}{hline 57}
{space 6}degree {c |}{res}      5,158    .7778209    .4157512          0          1
{txt}{space 8}dist {c |}{res}      5,158    8.519775    5.233976          0         25
{txt}
{com}.                 eststo sum_period2: quietly estpost summarize male ability_math ability_language parentcollege school degree dist if period==2
{txt}
{com}.                 
.                 corr male ability_math ability_language parentcollege school degree  dist if period==2
{txt}(obs=5,158)

             {c |}     male abilit~h abilit~e parent~e   school   degree     dist
{hline 13}{c +}{hline 63}
        male {c |}{res}   1.0000
{txt}ability_math {c |}{res}   0.0124   1.0000
{txt}ability_la~e {c |}{res}  -0.0764   0.7348   1.0000
{txt}parentcoll~e {c |}{res}  -0.0126   0.3100   0.3367   1.0000
      {txt}school {c |}{res}  -0.1550   0.5348   0.5619   0.3316   1.0000
      {txt}degree {c |}{res}  -0.1372   0.4454   0.4729   0.2439   0.6304   1.0000
        {txt}dist {c |}{res}   0.0595   0.0158   0.0128  -0.0749  -0.0246  -0.0171   1.0000

{txt}
{com}.                 eststo corr_period2: quietly estpost correlate  male ability_math ability_language parentcollege school degree dist if period==2,matrix 
{txt}
{com}. 
.                 reg school male ability_math ability_language parentcollege dist if period==2 & degree==1 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     4,012
{txt}{hline 13}{c +}{hline 34}   F(5, 4006)      = {res}   260.95
{txt}       Model {c |} {res} 185.793656         5  37.1587312   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 570.440392     4,006  .142396503   {txt}R-squared       ={res}    0.2457
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2447
{txt}       Total {c |} {res} 756.234048     4,011  .188540027   {txt}Root MSE        =   {res} .37735

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.0966701{col 30}{space 2} .0120665{col 41}{space 1}   -8.01{col 50}{space 3}0.000{col 58}{space 4}-.1203271{col 71}{space 3} -.073013
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .1287359{col 30}{space 2}  .010372{col 41}{space 1}   12.41{col 50}{space 3}0.000{col 58}{space 4} .1084011{col 71}{space 3} .1490708
{txt}ability_language {c |}{col 18}{res}{space 2} .1284727{col 30}{space 2} .0099104{col 41}{space 1}   12.96{col 50}{space 3}0.000{col 58}{space 4} .1090428{col 71}{space 3} .1479026
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .1091829{col 30}{space 2} .0132487{col 41}{space 1}    8.24{col 50}{space 3}0.000{col 58}{space 4} .0832081{col 71}{space 3} .1351578
{txt}{space 12}dist {c |}{col 18}{res}{space 2}-.0016354{col 30}{space 2} .0011565{col 41}{space 1}   -1.41{col 50}{space 3}0.157{col 58}{space 4}-.0039028{col 71}{space 3}  .000632
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} .7027906{col 30}{space 2} .0133565{col 41}{space 1}   52.62{col 50}{space 3}0.000{col 58}{space 4} .6766044{col 71}{space 3} .7289768
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.                 eststo reg_period2_Col: quietly regress  school male ability_math ability_language parentcollege dist if period==2 & degree==1 
{txt}
{com}. 
.                 
.                 **************Latex Table Produce
.                 
.                 esttab sum_period1 sum_period2  using "Part1_SumTable.tex" , cells(mean(fmt(6)) ) replace mtitle("t=1""t=2")  nonumbers collabels(none)
{res}{txt}(output written to {browse  `"Part1_SumTable.tex"'})

{com}.                 esttab reg_period1_HS reg_period1_De reg_period2_Col using "Part1_RegTable.tex", replace mtitle("HighSchool""HighSchoolDegree""College") collabels(none) nonumbers se
{res}{txt}(output written to {browse  `"Part1_RegTable.tex"'})

{com}.                 esttab corr_period1 using corr_period1.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=1")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period1.tex"'})

{com}.                 esttab corr_period2 using corr_period2.tex, replace unstack not noobs nonote b(3) nostar mtitle("t=2")  nonumbers 
{res}{txt}(output written to {browse  `"corr_period2.tex"'})

{com}.                 
.                 
.         // Question 2
.         
.         // Question 2.c
.         ***************Period 1******************
.         
.         ***************HighSchool Decision********
.         capture drop ST_HS_Prob
{txt}
{com}.         logit school male ability_math ability_language parentcollege if period==1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1617.1065}  
Iteration 1:{space 3}log likelihood = {res:-1364.6774}  
Iteration 2:{space 3}log likelihood = {res:-1298.6537}  
Iteration 3:{space 3}log likelihood = {res:-1296.9511}  
Iteration 4:{space 3}log likelihood = {res:-1296.9489}  
Iteration 5:{space 3}log likelihood = {res:-1296.9489}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     5,158
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    640.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1296.9489{txt}{col 49}Pseudo R2{col 67}= {res}    0.1980

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          school{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      z{col 50}   P>|z|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}male {c |}{col 18}{res}{space 2}-.9491516{col 30}{space 2} .1106502{col 41}{space 1}   -8.58{col 50}{space 3}0.000{col 58}{space 4}-1.166022{col 71}{space 3}-.7322812
{txt}{space 4}ability_math {c |}{col 18}{res}{space 2} .5250864{col 30}{space 2} .0807139{col 41}{space 1}    6.51{col 50}{space 3}0.000{col 58}{space 4} .3668901{col 71}{space 3} .6832828
{txt}ability_language {c |}{col 18}{res}{space 2} .7062783{col 30}{space 2} .0812405{col 41}{space 1}    8.69{col 50}{space 3}0.000{col 58}{space 4} .5470499{col 71}{space 3} .8655067
{txt}{space 3}parentcollege {c |}{col 18}{res}{space 2} .9583825{col 30}{space 2} .1899294{col 41}{space 1}    5.05{col 50}{space 3}0.000{col 58}{space 4} .5861277{col 71}{space 3} 1.330637
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 3.096661{col 30}{space 2} .1038889{col 41}{space 1}   29.81{col 50}{space 3}0.000{col 58}{space 4} 2.893042{col 71}{space 3} 3.300279
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.         est sto ST_HS
{txt}
{com}.         predict ST_HS_Prob  
{txt}(option {bf:pr} assumed; Pr(school))

{com}. 
{txt}end of do-file

{com}. do "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{txt}
{com}.         // Environment
.     clear all
{res}{txt}
{com}.         cd "C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution"
{res}C:\Users\33678\Desktop\Deeqa_EEE\Advanced econometrics and empirical economics\Part 1\Assisgnment\Solution
{txt}
{com}.         use "data_assignment.dta", clear
{txt}
{com}. 
.         log using "Log_BinCHENG"
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. run "C:\Users\33678\AppData\Local\Temp\STD2a00_000000.tmp"
{smcl}
{com}{sf}{ul off}